"""کاربرد های بک اسلش"""
print('1.farbod\nkhani')
print("2.farbod\'khani")
print('3.farbod\\khani')
print("4.farbod\tkhani")
print("5.farbod\rkhani.5")
print("\n__________________________________________________\n")
"""مبحث یونیکد: هر کاراکتر در کامپیوتر با یک کد شناخته میشود . 
برای چاپ کاراکتر هایی که در کیبورد نیستند از یونی کد استفاده میکنیم. بدین شیوه:"""
print(ord("A"))
"""1.برای نشان دادن کد یونیکد یک کاراکتر از این دستور استفاده میشود"""
print(chr(65))
print("\n__________________________________________________\n")
"""2.برای تبدیل یونیکد به کاراکتر ازین روش استفاده  میکنیم"""
print("chr: \u2DA9")
print('chr: \u2DA1')
print("\n__________________________________________________\n")
"""اگر داخل پرانتز یک آر بزاریم تمام عملگر ها رو از کار میندازه """
print(r"salam\t man \n farbod\'khani\\hastam")
print("salam\t man \n farbod\'khani\\hastam")
print("\n__________________________________________________\n")

"""چند متد کاربردی در راستای استفاده ار استرینگ ها"""
s="farbod khani 1377 python"
l=['A', 'B', '8']
print(s.capitalize())
print("\n__________________________________________________\n")
print(s.rstrip('7'))
print("\n__________________________________________________\n")
print(s.lstrip('7'))
print("\n__________________________________________________\n")
print(s.strip(''))
print("\n__________________________________________________\n")
print(s.join(l))
print("\n__________________________________________________\n")
print(s.split(' '))
print("\n__________________________________________________\n")
print(s.replace('a','*****'))
print("\n__________________________________________________\n")