"""برای رند کردن یک رقم اعشاری از این دستور استفاده میکنیم"""
a = 1.23456
print(round(a,1))

"""فرمت دهی رشته ها با استفاده از % درصد """ 
b = 1
c = 2.123456789
print('b is: %i\nc is: %f\nd is: %s\ne is: %c' % (b, c, 'farbod', (100 )))

#%o :رقم را به  برمبنای 8 نشان میدهد
print("%o" % (222))

#%x :رقم را برمبنای 16 نشان میدهد 
print("%x" %(10), '%X' %(10))

#%e :برای نشان دادن نماد علمی رقم استفاده میشود
print("%e" %(101213),"%E" %(101213))  

#%.2f :با تغییر رقم بعد نقطه میتوانیم نمایش ارقام اعشاری را کمترل کنیم
f = 1.23456789
print("%.4f" %(f))
print("%+4.2f" %(f))

#میتوانیم از دیکشنری ها نیز درین امر استفاده کنیم
g = {'a': 1, 'b': 2.3,'c': "farbod" }
print('%(a)i\n%(b)f\n%(c)s' %(g))

#برای زمانی که میخواهیم از کاربر ورودی بگبریم از اپراتور * استفاده میکنیم
h = 9.876543210
i = int(input("i: "))
j = int(input("j: "))
print("%0*.*f" %(j, i, h))